MikroElektronika/core_packages/ARM/gcc_clang/def/geehy/APM32F003F4/mcu.h
/*!
 * @file        apm32f00x.h
 *
 * @brief       CMSIS Cortex-M0+ Device Peripheral Access Layer Header File
 *
 * @version     V1.0.2
 *
 * @date        2023-03-31
 *
 * @attention
 *
 *  Copyright (C) 2023 Geehy Semiconductor
 *
 *  You may not use this file except in compliance with the
 *  GEEHY COPYRIGHT NOTICE (GEEHY SOFTWARE PACKAGE LICENSE).
 *
 *  The program is only for reference, which is distributed in the hope
 *  that it will be useful and instructional for customers to develop
 *  their software. Unless required by applicable law or agreed to in
 *  writing, the program is distributed on an "AS IS" BASIS, WITHOUT
 *  ANY WARRANTY OR CONDITIONS OF ANY KIND, either express or implied.
 *  See the GEEHY SOFTWARE PACKAGE LICENSE for the governing permissions
 *  and limitations under the License.
 */

/* Define to prevent recursive inclusion */
#ifndef __APM32F0XX_H
#define __APM32F0XX_H

#ifdef __cplusplus
 extern "C" {
#endif

/** @addtogroup CMSIS
  @{
*/

/** @addtogroup APM32F00x
  @{
*/

/** @defgroup HSE_Macros
  @{
*/

/* Define Value of the External oscillator in Hz */
#define HXT_VALUE           ((uint32_t)16000000)

/* Define Value of the High speed Internal oscillator in Hz */
#define HIRC_VALUE          ((uint32_t)48000000)

/* Define Value of the Low speed Internal oscillator in Hz */
#define LIRC_VALUE          ((uint32_t)128000)

/* Time out for HXT start up */
// Note: Added for MikroE implementation.
#define HXT_STARTUP_TIMEOUT
#if !defined  (HXT_STARTUP_TIMEOUT)
#define HXT_STARTUP_TIMEOUT        ((uint32_t)0x5000)
#endif

/**@} end of group HSE_Macros */

/** @defgroup APM32F00x_StdPeripheral_Library_Version
  @{
*/

/*!< [31:16] APM32F00X Standard Peripheral Libraries main version V1.0.2*/
#define __APM32F00X_STDPERIPH_VERSION_MAIN   ((uint8_t)0x01) /*!< [31:24] main version */
#define __APM32F00X_STDPERIPH_VERSION_SUB1   ((uint8_t)0x00) /*!< [23:16] sub1 version */
#define __APM32F00X_STDPERIPH_VERSION_SUB2   ((uint8_t)0x00) /*!< [15:8]  sub2 version */
#define __APM32F00X_STDPERIPH_VERSION_RC     ((uint8_t)0x00) /*!< [7:0]  release candidate */
#define __APM32F00X_STDPERIPH_VERSION       ( (__APM32F00X_STDPERIPH_VERSION_MAIN << 24)\
                                          |(__APM32F00X_STDPERIPH_VERSION_SUB1 << 16)\
                                          |(__APM32F00X_STDPERIPH_VERSION_SUB2 << 8)\
                                          |(__APM32F00X_STDPERIPH_VERSION_RC))

/**@} end of group APM32F00x_StdPeripheral_Library_Version */

/** @defgroup Configuraion_for_CMSIS
  @{
*/

/* Core Revision r0p1  */
#define __CM0_REV                 0
/* APM32F0xx do not provide MPU  */
#define __MPU_PRESENT             0
/* APM32F0xx uses 2 Bits for the Priority Levels */
#define __NVIC_PRIO_BITS          2
/* Set to 1 if different SysTick Config is used */
#define __Vendor_SysTickConfig    0

/**@} end of group Configuraion_for_CMSIS */

/** @defgroup Peripheral_Enumerations
  @{
*/

/**
 * @brief    Interrupt Number Definition
 */
typedef enum IRQn
{
    NonMaskableInt_IRQn         = -14,    /*!< 2 Non Maskable Interrupt                                */
    HardFault_IRQn              = -13,    /*!< 3 Cortex-M0 Hard Fault Interrupt                        */
    SVC_IRQn                    = -5,     /*!< 11 Cortex-M0 SV Call Interrupt                          */
    PendSV_IRQn                 = -2,     /*!< 14 Cortex-M0 Pend SV Interrupt                          */
    SysTick_IRQn                = -1,     /*!< 15 Cortex-M0 System Tick Interrupt                      */

    /*****  CHAOFENG specific Interrupt Numbers *************************************/

    WUPT_IRQn                   = 1,      /*!< Wakeup timer                                            */
    RCM_IRQn                    = 2,      /*!< Clock controller interrupt                              */
    EINTA_IRQn                  = 3,      /*!< Port A external interrupts                              */
    EINTB_IRQn                  = 4,      /*!< Port B external interrupts                              */
    EINTC_IRQn                  = 5,      /*!< Port C external interrupts                              */
    EINTD_IRQn                  = 6,      /*!< Port D external interrupts                              */
    SPI_IRQn                    = 10,     /*!< SPI Interrupt                                           */
    TMR1_UT_IRQn                = 11,     /*!< TIMER1 update/overflow/underflow/trigger/break interrupt */
    TMR1_CC_IRQn                = 12,     /*!< TIMER1 capture/compare interrupt                         */
    TMR2_UO_IRQn                = 13,     /*!< TIMER2 update /overflow interrupt                        */
    TMR2_CC_IRQn                = 14,     /*!< TIMER2 capture/compare interrupt                         */
    USART1_TX_IRQn              = 17,     /*!< USART1 TX interrupt                                      */
    USART1_RX_IRQn              = 18,     /*!< USART1 RX interrupt                                      */
    IIC_IRQn                    = 19,     /*!< I2C Interrupt                                            */
    ADC_IRQn                    = 22,     /*!< ADC interrupt                                            */
    TMR4_IRQn                   = 23,     /*!< TIMER4 interrupt                                         */
    FLASH_IRQn                  = 24,     /*!< Flash interrupt                                          */
    USART3_TX_IRQn              = 25,     /*!< USART3 TX interrupt                                      */
    USART3_RX_IRQn              = 26,     /*!< USART3 RX interrupt                                      */
    USART2_TX_IRQn              = 27,     /*!< USART2 TX interrupt                                      */
    USART2_RX_IRQn              = 28,     /*!< USART2 RX interrupt                                      */
    TMR1A_UT_IRQn               = 29,     /*!< TIMER1A update/overflow/underflow/trigger/break interrupt*/
    TMR1A_CC_IRQn               = 30,     /*!< TIMER1A capture/compare interrupt                        */
} IRQn_Type;

/**@} end of group Device_IRQ*/


#include "core_cm0plus.h"
#include <stdint.h>
// Note: Changed for MikroE implementation.
//#include "system_apm32f00x.h"
#define __I volatile // Note: Added for MikroE implementation.
#define __O __I // Note: Added for MikroE implementation.
#define __IO __I // Note: Added for MikroE implementation.

/** @defgroup Exported_Types
  @{
*/

