MikroElektronika/core_packages/ARM/gcc_clang/def/geehy/APM32F003F4/mcu.h
typedef enum {FALSE, TRUE} BOOL;
enum {RESET = 0, SET = !RESET};
enum {BIT_RESET, BIT_SET};
enum {DISABLE = 0, ENABLE = !DISABLE};
enum {ERROR = 0, SUCCESS = !ERROR};

#ifndef __IM                                    /*!< Fallback for older CMSIS versions                                         */
  #define __IM   __I
#endif
#ifndef __OM                                    /*!< Fallback for older CMSIS versions                                         */
  #define __OM   __O
#endif
#ifndef __IOM                                   /*!< Fallback for older CMSIS versions                                         */
  #define __IOM  __IO
#endif

#ifndef NULL
#define NULL    ((void *)0)
#endif

#if defined (__CC_ARM )
#pragma anon_unions
#endif

/**@} end of group Exported_Types */

/** @defgroup Peripheral_registers_structures
  @{
*/

/**
 * @brief  General Purpose I/Os (GPIO)
 */
typedef struct
{
    /* Data output register */
    union
    {
        __IOM uint32_t DOUT;

        struct
        {
            __IOM uint32_t DOUT0            : 1;
            __IOM uint32_t DOUT1            : 1;
            __IOM uint32_t DOUT2            : 1;
            __IOM uint32_t DOUT3            : 1;
            __IOM uint32_t DOUT4            : 1;
            __IOM uint32_t DOUT5            : 1;
            __IOM uint32_t DOUT6            : 1;
            __IOM uint32_t DOUT7            : 1;
            __IM  uint32_t RESERVED         : 24;
        } DOUT_B;
    } ;

    /* Data input register */
    union
    {
        __IOM uint32_t DIN;

        struct
        {
            __IOM uint32_t DIN0             : 1;
            __IOM uint32_t DIN1             : 1;
            __IOM uint32_t DIN2             : 1;
            __IOM uint32_t DIN3             : 1;
            __IOM uint32_t DIN4             : 1;
            __IOM uint32_t DIN5             : 1;
            __IOM uint32_t DIN6             : 1;
            __IOM uint32_t DIN7             : 1;
            __IM  uint32_t RESERVED         : 24;
        } DIN_B;
    } ;

    /* input / ouput mode register */
    union
    {
        __IOM uint32_t MODE;

        struct
        {
            __IOM uint32_t MODE0            : 1;
            __IOM uint32_t MODE1            : 1;
            __IOM uint32_t MODE2            : 1;
            __IOM uint32_t MODE3            : 1;
            __IOM uint32_t MODE4            : 1;
            __IOM uint32_t MODE5            : 1;
            __IOM uint32_t MODE6            : 1;
            __IOM uint32_t MODE7            : 1;
            __IM  uint32_t RESERVED         : 24;
        } MODE_B;
    } ;

    /* Control Register 1 */
    union
    {
        __IOM uint32_t CTRL1;

        struct
        {
            __IOM uint32_t CR0              : 1;
            __IOM uint32_t CR1              : 1;
            __IOM uint32_t CR2              : 1;
            __IOM uint32_t CR3              : 1;
            __IOM uint32_t CR4              : 1;
            __IOM uint32_t CR5              : 1;
            __IOM uint32_t CR6              : 1;
            __IOM uint32_t CR7              : 1;
            __IM  uint32_t RESERVED         : 24;
        } CTRL1_B;
    } ;

    /* Control Register 2 */
    union
    {
        __IOM uint32_t CTRL2;

        struct
        {
            __IOM uint32_t CR0              : 1;
            __IOM uint32_t CR1              : 1;
            __IOM uint32_t CR2              : 1;
            __IOM uint32_t CR3              : 1;
            __IOM uint32_t CR4              : 1;
            __IOM uint32_t CR5              : 1;
            __IOM uint32_t CR6              : 1;
            __IOM uint32_t CR7              : 1;
            __IM  uint32_t RESERVED         : 24;
        } CTRL2_B;
    } ;

    __IM uint32_t RESERVED1[59];

    /* GPIO JTAGDIS Register */
    union
    {
        __IOM uint32_t GPIO_JTAGDIS;

        struct
        {
            __IOM uint32_t JTAGDIS          : 1;
            __IM  uint32_t RESERVED         : 31;
        } JTAGDIS_B;
    } ;
} GPIO_T;

/**
 * @brief  Reset and Clock Management (RCM)
 */
typedef struct
{
    /* Internal clock control register */
    union
    {
        __IOM uint32_t ICC;

        struct
        {
            __IOM uint32_t HIRCEN           : 1;
            __IM  uint32_t HIRCRF           : 1;
            __IOM uint32_t FWFHEN           : 1;
            __IOM uint32_t LIRCEN           : 1;
            __IM  uint32_t LIRCRF           : 1;
            __IOM uint32_t RPOEN            : 1;
            __IM  uint32_t RESERVED         : 26;
        } ICC_B;
    } ;

    /* External clock control register */
    union
    {
        __IOM uint32_t ECC;

        struct
        {
            __IOM uint32_t HXTEN            : 1;
            __IM  uint32_t HXTRF            : 1;
            __IM  uint32_t RESERVED         : 30;
        } ECC_B;
    } ;

    __IM uint32_t RESERVED1;

    /* Master Clock status register */
    union
    {
        __IOM uint32_t MCS;

        struct
        {
            __IOM uint32_t MCS              : 8;
            __IM  uint32_t RESERVED         : 24;
        } MCLKSTS_B;
    } ;

    /* Master Clock selection register */
    union
    {
        __IOM uint32_t MCC;

        struct
        {
            __IOM uint32_t MCC              : 8;
            __IM  uint32_t RESERVED         : 24;
        } MCC_B;
    } ;

    /* Master Clock switch control register */
    union
    {
        __IOM uint32_t CSC;

        struct
        {
            __IOM uint32_t CSBF             : 1;
            __IOM uint32_t CSEN             : 1;
            __IOM uint32_t CSIE             : 1;
            __IOM uint32_t CSIF             : 1;
            __IM  uint32_t RESERVED         : 28;
        } CSC_B;
    } ;

    /* Clock divider number register */
    union
    {
        __IOM uint32_t CLKDIV;

        struct
        {
            __IOM uint32_t CPUDIV           : 3;
            __IOM uint32_t HIRCDIV          : 2;
            __IOM uint32_t HDS              : 1;
            __IM  uint32_t RESERVED         : 26;
        } CLKDIV_B;
    } ;

