MikroElektronika/core_packages/ARM/gcc_clang/def/geehy/APM32F003F4/mcu.h
    /* APB peripheral clock enable register1 */
    union
    {
        __IOM uint32_t APBEN1;

        struct
        {
            __IOM uint32_t I2CCEN           : 1;
            __IOM uint32_t SPICEN           : 1;
            __IOM uint32_t RESERVED1        : 1;
            __IOM uint32_t USART1CEN        : 1;
            __IOM uint32_t TMR4CEN          : 1;
            __IOM uint32_t TMR2CEN          : 1;
            __IOM uint32_t RESERVED2        : 1;
            __IOM uint32_t TMR1CEN          : 1;
            __IM  uint32_t RESERVED3        : 24;
        } APBEN1_B;
    } ;

    /* Clock security system register */
    union
    {
        __IOM uint32_t CSS;

        struct
        {
            __IOM uint32_t CSSEN            : 1;
            __IOM uint32_t BCEN             : 1;
            __IOM uint32_t CSSFDIE          : 1;
            __IOM uint32_t CSSFDIF          : 1;
            __IM  uint32_t RESERVED         : 28;
        } CSS_B;
    } ;

    /* clock output control register */
    union
    {
        __IOM uint32_t COC;

        struct
        {
            __IOM uint32_t COEN             : 1;
            __IOM uint32_t COS              : 4;
            __IM  uint32_t CORF             : 1;
            __IM  uint32_t COBF             : 1;
            __IM  uint32_t RESERVED         : 25;
        } COC_B;
    } ;

    /* APB peripheral clock enable register2 */
    union
    {
        __IOM uint32_t APBEN2;

        struct
        {
            __IM  uint32_t RESERVED1        : 2;
            __IOM uint32_t WUPTCEN          : 1;
            __IOM uint32_t ADCCEN           : 1;
            __IM  uint32_t RESERVED2        : 28;
        } APBEN2_B;
    } ;

    __IM  uint32_t RESERVED2;

    /* HIRC clock calibration trimming register */
    union
    {
        __IOM uint32_t HIRCTRIM;

        struct
        {
            __IOM uint32_t TRIM             : 4;
            __IM  uint32_t RESERVED         : 28;
        } HIRCTRIM_B;
    } ;

    __IM  uint32_t RESERVED3;

    /* Reset status register */
    union
    {
        __IOM uint32_t RSTSTS;

        struct
        {
            __IM  uint32_t WWDTRF           : 1;
            __IM  uint32_t IWDTRF           : 1;
            __IM  uint32_t CPURF            : 1;
            __IM  uint32_t RESERVED1        : 1;
            __IM  uint32_t EMCRF            : 1;
            __IM  uint32_t RESERVED2        : 27;
        } RSTSTS_B;
    } ;

    /* APB peripheral clock enable register3 */
    union
    {
        __IOM uint32_t APBEN3;

        struct
        {
            __IOM uint32_t TMR1ACEN         : 1;
            __IOM uint32_t USART2CEN        : 1;
            __IOM uint32_t USART3CEN        : 1;
            __IM  uint32_t RESERVED         : 29;
        } APBEN3_B;
    } ;
} RCM_T;

/**
 * @brief    Universal synchronous asynchronous receiver transmitter (USART)
 */
typedef struct
{
    /* Status register */
    union
    {
        __IOM uint32_t STS;
        struct
        {
            __IM  uint32_t PEF              : 1;
            __IM  uint32_t FEF              : 1;
            __IM  uint32_t NEF              : 1;
            __IM  uint32_t OEF              : 1;
            __IM  uint32_t IDLEF            : 1;
            __IM  uint32_t RXBNEF           : 1;
            __IM  uint32_t TXCF             : 1;
            __IM  uint32_t TXBEF            : 1;
            __IM  uint32_t RESERVED         : 24;
        }STS_B;
    };

    /* DATA register */
    union
    {
        __IOM uint32_t DATA;
        struct
        {
            __IOM uint32_t DATA             : 8;
            __IM  uint32_t RESERVED         : 24;
        }DATA_B;
    };

    /* Baud rate register 1  */
    union
    {
        __IOM uint32_t BR1;
        struct
        {
            __IOM uint32_t DIV11_4          : 8;
            __IM  uint32_t RESERVED         : 24;
        }BR1_B;
    };

    /* Baud rate register 0  */
    union
    {
        __IOM uint32_t BR0;
        struct
        {
            __IOM uint32_t DIV3_0           : 4;
            __IOM uint32_t DIV15_12         : 4;
            __IM  uint32_t RESERVED         : 24;
        }BR0_B;
    };

    /* Control register 1  */
    union
    {
        __IOM uint32_t CTRL1;
        struct
        {
            __IOM uint32_t PIE              : 1;
            __IOM uint32_t PSEL             : 1;
            __IOM uint32_t PEN              : 1;
            __IOM uint32_t WMS              : 1;
            __IOM uint32_t DBL              : 1;
            __IOM uint32_t USARTDIS         : 1;
            __IOM uint32_t TDB8             : 1;
            __IOM uint32_t RDB8             : 1;
            __IM  uint32_t RESERVED         : 24;
        }CTRL1_B;
    };

    /* Control register 2  */
    union
    {
        __IOM uint32_t CTRL2;
        struct
        {
            __IOM uint32_t TXBRK            : 1;
            __IOM uint32_t RMM              : 1;
            __IOM uint32_t RXEN             : 1;
            __IOM uint32_t TXEN             : 1;
            __IOM uint32_t IDLEIE           : 1;
            __IOM uint32_t RXIE             : 1;
            __IOM uint32_t TXCIE            : 1;
            __IOM uint32_t TXIE             : 1;
            __IM  uint32_t RESERVED         : 24;
        }CTRL2_B;
    };

    /* Control register 3 */
    union
    {
        __IOM uint32_t CTRL3;
        struct
        {
            __IOM uint32_t LBCP             : 1;
            __IOM uint32_t CLKPHA           : 1;
            __IOM uint32_t CLKPOL           : 1;
            __IOM uint32_t CLKEN            : 1;
            __IOM uint32_t SBS              : 2;
            __IOM uint32_t LINEN            : 1;
            __IM  uint32_t RESERVED         : 25;
        }CTRL3_B;
    };

    /* Control register 4 */
    union
    {
        __IOM uint32_t CTRL4;
        struct
        {
            __IOM uint32_t ADDR             : 4;
            __IOM uint32_t LMBDF            : 1;
            __IOM uint32_t LMBDL            : 1;
            __IOM uint32_t LMBDIE           : 1;
            __IM  uint32_t RESERVED         : 25;
        }CTRL4_B;
    };

    /* Control register 5 */
    union
    {
        __IOM uint32_t CTRL5;
        struct
        {
            __IM  uint32_t RESERVED1        : 1;
            __IOM uint32_t IRDAEN           : 1;
            __IOM uint32_t ILPM             : 1;
            __IOM uint32_t HDMEN            : 1;
            __IOM uint32_t NACKEN           : 1;
            __IOM uint32_t SMEN             : 1;
            __IM  uint32_t RESERVED2        : 26;
        }CTRL5_B;
    };

