MikroElektronika/core_packages/ARM/gcc_clang/def/geehy/APM32F003F4/mcu.h
    /* Control register 2 */
    union
    {
        __IOM uint32_t CTRL2;
        struct
        {
            __IOM uint32_t CCBEN            : 1;
            __IM  uint32_t RESERVED1        : 1;
            __IOM uint32_t CCUS             : 1;
            __IOM uint32_t RESERVED2        : 1;
            __IOM uint32_t MMFC             : 3;
            __IM  uint32_t RESERVED3        : 25;
        }CTRL2_B;
    };

    /* Slave mode congrol register */
    union
    {
        __IOM uint32_t SMC;
        struct
        {
            __IOM uint32_t SMFC             : 3;
            __IM  uint32_t RESERVED1        : 1;
            __IOM uint32_t ITC              : 3;
            __IOM uint32_t MSMEN            : 1;
            __IM  uint32_t RESERVED2        : 24;
        }SMC_B;
    };

    /* External trigger control register */
    union
    {
        __IOM uint32_t ETC;
        struct
        {
            __IOM uint32_t ETFC             : 4;
            __IOM uint32_t ETRC             : 2;
            __IOM uint32_t ECM2EN           : 1;
            __IOM uint32_t ETPC             : 1;
            __IM  uint32_t RESERVED         : 24;
        }ETC_B;
    };

    /* interrupt control register */
    union
    {
        __IOM uint32_t INTCTRL;
        struct
        {
            __IOM uint32_t UDIE             : 1;
            __IOM uint32_t CH1CCIE          : 1;
            __IOM uint32_t CH2CCIE          : 1;
            __IOM uint32_t CH3CCIE          : 1;
            __IOM uint32_t CH4CCIE          : 1;
            __IOM uint32_t CCUIE            : 1;
            __IOM uint32_t TRGIE            : 1;
            __IOM uint32_t BRKIE            : 1;
            __IM  uint32_t RESERVED         : 24;
        }INTCTRL_B;
    };

    /* status register 1 */
    union
    {
        __IOM uint32_t STS1;
        struct
        {
            __IOM uint32_t UDIF             : 1;
            __IOM uint32_t CH1CCIF          : 1;
            __IOM uint32_t CH2CCIF          : 1;
            __IOM uint32_t CH3CCIF          : 1;
            __IOM uint32_t CH4CCIF          : 1;
            __IOM uint32_t CCUIF            : 1;
            __IOM uint32_t TRGIF            : 1;
            __IOM uint32_t BRKIF            : 1;
            __IM  uint32_t RESERVED         : 24;
        }STS1_B;
    };

    /* status register 2 */
    union
    {
        __IOM uint32_t STS2;
        struct
        {
            __IM  uint32_t RESERVED1        : 1;
            __IOM uint32_t CH1RCF           : 1;
            __IOM uint32_t CH2RCF           : 1;
            __IOM uint32_t CH3RCF           : 1;
            __IOM uint32_t CH4RCF           : 1;
            __IM  uint32_t RESERVED2        : 27;
        }STS2_B;
    };

    /* Software control event generate register */
    union
    {
        __IOM uint32_t SCEG;
        struct
        {
            __IOM uint32_t UEG              : 1;
            __IOM uint32_t CH1CCG           : 1;
            __IOM uint32_t CH2CCG           : 1;
            __IOM uint32_t CH3CCG           : 1;
            __IOM uint32_t CH4CCG           : 1;
            __IOM uint32_t CCUEG            : 1;
            __IOM uint32_t TEG              : 1;
            __IOM uint32_t BEG              : 1;
            __IM  uint32_t RESERVED2        : 24;
        }SCEG_B;
    };

    /* Channel 1 compare/capture mode register */
    union
    {
        __IOM uint32_t CH1CCM;

        struct
        {
            __IOM uint32_t MODESEL          : 2;
            __IOM uint32_t OCFEN            : 1;
            __IOM uint32_t OCBEN            : 1;
            __IOM uint32_t OCMS             : 3;
            __IOM uint32_t OCCEN            : 1;
            __IM  uint32_t RESERVED         : 24;
        }CH1OC_B;

        struct
        {
            __IOM uint32_t MODESEL          : 2;
            __IOM uint32_t IC1PSC           : 2;
            __IOM uint32_t ICFC             : 4;
            __IM  uint32_t RESERVED         : 24;
        }CH1IC_B;
    };

    /* Channel 2 compare/capture mode register */
    union
    {
        __IOM uint32_t CH2CCM;

        struct
        {
            __IOM uint32_t MODESEL          : 2;
            __IOM uint32_t OCFEN            : 1;
            __IOM uint32_t OCBEN            : 1;
            __IOM uint32_t OCMS             : 3;
            __IOM uint32_t OCCEN            : 1;
            __IM  uint32_t RESERVED         : 24;
        }CH2OC_B;

        struct
        {
            __IOM uint32_t MODESEL          : 2;
            __IOM uint32_t IC2PSC           : 2;
            __IOM uint32_t ICFC             : 4;
            __IM  uint32_t RESERVED         : 24;
        }CH2IC_B;
    };

    /* Channel 3 compare/capture mode register */
    union
    {
        __IOM uint32_t CH3CCM;

        struct
        {
            __IOM uint32_t MODESEL          : 2;
            __IOM uint32_t OCFEN            : 1;
            __IOM uint32_t OCBEN            : 1;
            __IOM uint32_t OCMS             : 3;
            __IOM uint32_t OCCEN            : 1;
            __IM  uint32_t RESERVED         : 24;
        }CH3OC_B;

        struct
        {
            __IOM uint32_t MODESEL          : 2;
            __IOM uint32_t IC3PSC           : 2;
            __IOM uint32_t ICFC             : 4;
            __IM  uint32_t RESERVED         : 24;
        }CH3IC_B;
    };

    /* Channel 4 compare/capture mode register */
    union
    {
        __IOM uint32_t CH4CCM;

        struct
        {
            __IOM uint32_t MODESEL          : 2;
            __IOM uint32_t OCFEN            : 1;
            __IOM uint32_t OCBEN            : 1;
            __IOM uint32_t OCMS             : 3;
            __IOM uint32_t OCCEN            : 1;
            __IM  uint32_t RESERVED         : 24;
        }CH4OC_B;

        struct
        {
            __IOM uint32_t MODESEL          : 2;
            __IOM uint32_t IC4PSC           : 2;
            __IOM uint32_t ICFC             : 4;
            __IM  uint32_t RESERVED         : 24;
        }CH4IC_B;
    };

    /* Channel control register 1 */
    union
    {
        __IOM uint32_t CHCTRL1;

        struct
        {
            __IOM uint32_t CH1CCEN          : 1;
            __IOM uint32_t CH1CCP           : 1;
            __IOM uint32_t CH1OCNEN         : 1;
            __IOM uint32_t CH1OCNP          : 1;
            __IOM uint32_t CH2CCEN          : 1;
            __IOM uint32_t CH2CCP           : 1;
            __IOM uint32_t CH2OCNEN         : 1;
            __IOM uint32_t CH2OCNP          : 1;
            __IM  uint32_t RESERVED         : 24;
        }CHCTRL1_B;
    };

    /* Channel control register 2 */
    union
    {
        __IOM uint32_t CHCTRL2;

        struct
        {
            __IOM uint32_t CH3CCEN          : 1;
            __IOM uint32_t CH3CCP           : 1;
            __IM  uint32_t RESERVED1        : 1;
            __IM  uint32_t RESERVED2        : 1;
            __IOM uint32_t CH4CCEN          : 1;
            __IOM uint32_t CH4CCP           : 1;
            __IM  uint32_t RESERVED3        : 1;
            __IM  uint32_t RESERVED4        : 1;
            __IM  uint32_t RESERVED5        : 24;
        }CHCTRL2_B;
    };

    /* Count register 1 */
    union
    {
        __IOM uint32_t CNT1;

        struct
        {
            __IOM uint32_t CNT              : 8;
            __IM  uint32_t RESERVED         : 24;
        }CNT1_B;
    };

    /* Count register 0 */
    union
    {
        __IOM uint32_t CNT0;

        struct
        {
            __IOM uint32_t CNT              : 8;
            __IM  uint32_t RESERVED         : 24;
        }CNT0_B;
    };

