MikroElektronika/core_packages/ARM/gcc_clang/def/geehy/APM32F003F4/mcu.h
    /* divider register 1 */
    union
    {
        __IOM uint32_t PSC1;

        struct
        {
            __IOM uint32_t PSC              : 8;
            __IM  uint32_t RESERVED         : 24;
        }DIV1_B;
    };

    /* divider register 0 */
    union
    {
        __IOM uint32_t PSC0;

        struct
        {
            __IOM uint32_t PSC              : 8;
            __IM  uint32_t RESERVED         : 24;
        }DIV0_B;
    };

    /* Auto reload register 1 */
    union
    {
        __IOM uint32_t AUTORLD1;

        struct
        {
            __IOM uint32_t AUTORLD          : 8;
            __IM  uint32_t RESERVED         : 24;
        }AUTORLD1_B;
    };

    /* Auto reload register 0 */
    union
    {
        __IOM uint32_t AUTORLD0;

        struct
        {
            __IOM uint32_t AUTORLD          : 8;
            __IM  uint32_t RESERVED         : 24;
        }AUTORLD0_B;
    };

    /* repetition count register 0 */
    union
    {
        __IOM uint32_t REPCNT;

        struct
        {
            __IOM uint32_t REPCNT           : 8;
            __IM  uint32_t RESERVED         : 24;
        }REPCNT_B;
    };

    /* channel 1 compare/capture register 1 */
    union
    {
        __IOM uint32_t CH1CC1;

        struct
        {
            __IOM uint32_t CC               : 8;
            __IM  uint32_t RESERVED         : 24;
        }CH1CC1_B;
    };

    /* channel 1 compare/capture register 0 */
    union
    {
        __IOM uint32_t CH1CC0;

        struct
        {
            __IOM uint32_t CC               : 8;
            __IM  uint32_t RESERVED         : 24;
        }CH1CC0_B;
    };

    /* channel 2 compare/capture register 1 */
    union
    {
        __IOM uint32_t CH2CC1;

        struct
        {
            __IOM uint32_t CC               : 8;
            __IM  uint32_t RESERVED         : 24;
        }CH2CC1_B;
    };

    /* channel 2 compare/capture register 0 */
    union
    {
        __IOM uint32_t CH2CC0;

        struct
        {
            __IOM uint32_t CC               : 8;
            __IM  uint32_t RESERVED         : 24;
        }CH2CC0_B;
    };

    /* channel 3 compare/capture register 1 */
    union
    {
        __IOM uint32_t CH3CC1;

        struct
        {
            __IOM uint32_t CC               : 8;
            __IM  uint32_t RESERVED         : 24;
        }CH3CC1_B;
    };

    /* channel 3 compare/capture register 0 */
    union
    {
        __IOM uint32_t CH3CC0;

        struct
        {
            __IOM uint32_t CC               : 8;
            __IM  uint32_t RESERVED         : 24;
        }CH3CC0_B;
    };

    /* channel 4 compare/capture register 1 */
    union
    {
        __IOM uint32_t CH4CC1;

        struct
        {
            __IOM uint32_t CC               : 8;
            __IM  uint32_t RESERVED         : 24;
        }CH4CC1_B;
    };

    /* channel 4 compare/capture register 0 */
    union
    {
        __IOM uint32_t CH4CC0;

        struct
        {
            __IOM uint32_t CC               : 8;
            __IM  uint32_t RESERVED         : 24;
        }CH4CC0_B;
    };

    /* Break control register */
    union
    {
        __IOM uint32_t BRKCTRL;

        struct
        {
            __IOM uint32_t PROTCFG          : 2;
            __IOM uint32_t IMOS             : 1;
            __IOM uint32_t RMOS             : 1;
            __IOM uint32_t BRKEN            : 1;
            __IOM uint32_t BRKPOL           : 1;
            __IOM uint32_t AOEN             : 1;
            __IOM uint32_t WOEN             : 1;
            __IM  uint32_t RESERVED         : 24;
        }BRKCTRL_B;
    };

    /* dead time setup register */
    union
    {
        __IOM uint32_t DTS;

        struct
        {
            __IOM uint32_t DTS              : 8;
            __IM  uint32_t RESERVED         : 24;
        }DTS_B;
    };

    /* idele status output register */
    union
    {
        __IOM uint32_t ISO;

        struct
        {
            __IOM uint32_t CH1ISO           : 1;
            __IOM uint32_t CH1NISO          : 1;
            __IOM uint32_t CH2ISO           : 1;
            __IOM uint32_t CH2NISO          : 1;
            __IOM uint32_t CH3ISO           : 1;
            __IOM uint32_t RESERVED1        : 1;
            __IOM uint32_t CH4ISO           : 1;
            __IM  uint32_t RESERVED         : 25;
        }ISO_B;
    };

    __IOM uint32_t RESERVED;

    /* Timer1A Channel enable register */
    union
    {
        __IOM uint32_t CHEN;

        struct
        {
            __IOM uint32_t CH1              : 1;
            __IOM uint32_t CH2              : 1;
            __IOM uint32_t CH3              : 1;
            __IOM uint32_t CH4              : 1;
            __IM  uint32_t RESERVED         : 28;
        }CHEN_B;
    };
}TMR1_T;

/**
 * @brief   Timer2
 */
typedef struct
{
    /* Control register 1 */
    union
    {
        __IOM uint32_t CTRL1;
        struct
        {
            __IOM uint32_t CNTEN            : 1;
            __IOM uint32_t NGUE             : 1;
            __IOM uint32_t UES              : 1;
            __IOM uint32_t SPMEN            : 1;
            __IM  uint32_t RESERVED1        : 3;
            __IOM uint32_t ARBEN            : 1;
            __IM  uint32_t RESERVED2        : 24;
        }CTRL1_B;
    };

    /* Control register 2 */
    union
    {
        __IOM uint32_t CTRL2;
        struct
        {
            __IM  uint32_t RESERVED1        : 4;
            __IOM uint32_t MMFC             : 3;
            __IM  uint32_t RESERVED2        : 25;
        }CTRL2_B;
    };

    /* Slave mode congrol register */
    union
    {
        __IOM uint32_t SMC;
        struct
        {
            __IOM uint32_t SMFC             : 3;
            __IM  uint32_t RESERVED1        : 1;
            __IOM uint32_t ITC              : 3;
            __IOM uint32_t MSMEN            : 1;
            __IM  uint32_t RESERVED2        : 24;
        }SMC_B;
    };

    /* interrupt control register */
    union
    {
        __IOM uint32_t INTCTRL;
        struct
        {
            __IOM uint32_t UDIE             : 1;
            __IOM uint32_t CH1CCIE          : 1;
            __IOM uint32_t CH2CCIE          : 1;
            __IOM uint32_t CH3CCIE          : 1;
            __IM  uint32_t RESERVED1        : 2;
            __IOM uint32_t TRGIE            : 1;
            __IM  uint32_t RESERVED2        : 25;
        }INTCTRL_B;
    };

    /* status register 1 */
    union
    {
        __IOM uint32_t STS1;
        struct
        {
            __IOM uint32_t UDIF             : 1;
            __IOM uint32_t CH1CCIF          : 1;
            __IOM uint32_t CH2CCIF          : 1;
            __IOM uint32_t CH3CCIF          : 1;
            __IM  uint32_t RESERVED1        : 2;
            __IOM uint32_t TRGIF            : 1;
            __IM  uint32_t RESERVED2        : 25;
        }STS1_B;
    };

    /* status register 2 */
    union
    {
        __IOM uint32_t STS2;
        struct
        {
            __IM  uint32_t RESERVED1        : 1;
            __IOM uint32_t CH1RCF           : 1;
            __IOM uint32_t CH2RCF           : 1;
            __IOM uint32_t CH3RCF           : 1;
            __IM  uint32_t RESERVED2        : 28;
        }STS2_B;
    };

    /* Software control event generate register */
    union
    {
        __IOM uint32_t SCEG;
        struct
        {
            __IOM uint32_t UEG              : 1;
            __IOM uint32_t CH1CCG           : 1;
            __IOM uint32_t CH2CCG           : 1;
            __IOM uint32_t CH3CCG           : 1;
            __IM  uint32_t RESERVED1        : 2;
            __IOM uint32_t TEG              : 1;
            __IM  uint32_t RESERVED2        : 25;
        }SCEG_B;
    };

    /* Channel 1 compare/capture mode register */
    union
    {
        __IOM uint32_t CH1CCM;

        struct
        {
            __IOM uint32_t MODESEL          : 2;
            __IM  uint32_t RESERVED1        : 1;
            __IOM uint32_t OCBEN            : 1;
            __IOM uint32_t OCMS             : 3;
            __IM  uint32_t RESERVED2        : 25;
        }CH1OC_B;

        struct
        {
            __IOM uint32_t MODESEL          : 2;
            __IOM uint32_t IC1PSC           : 2;
            __IOM uint32_t ICFC             : 4;
            __IM  uint32_t RESERVED         : 24;
        }CH1IC_B;
    };

    /* Channel 2 compare/capture mode register */
    union
    {
        __IOM uint32_t CH2CCM;

        struct
        {
            __IOM uint32_t MODESEL          : 2;
            __IM  uint32_t RESERVED1        : 1;
            __IOM uint32_t OCBEN            : 1;
            __IOM uint32_t OCMS             : 3;
            __IM  uint32_t RESERVED2        : 25;
        }CH2OC_B;

        struct
        {
            __IOM uint32_t MODESEL          : 2;
            __IOM uint32_t IC2PSC           : 2;
            __IOM uint32_t ICFC             : 4;
            __IM  uint32_t RESERVED         : 24;
        }CH2IC_B;
    };

    /* Channel 3 compare/capture mode register */
    union
    {
        __IOM uint32_t CH3CCM;

        struct
        {
            __IOM uint32_t MODESEL          : 2;
            __IM  uint32_t RESERVED1        : 1;
            __IOM uint32_t OCBEN            : 1;
            __IOM uint32_t OCMS             : 3;
            __IM  uint32_t RESERVED2        : 25;
        }CH3OC_B;

        struct
        {
            __IOM uint32_t MODESEL          : 2;
            __IOM uint32_t IC3PSC           : 2;
            __IOM uint32_t ICFC             : 4;
            __IM  uint32_t RESERVED         : 24;
        }CH3IC_B;
    };

    /* Channel control register 1 */
    union
    {
        __IOM uint32_t CHCTRL1;

        struct
        {
            __IOM uint32_t CH1CCEN          : 1;
            __IOM uint32_t CH1CCP           : 1;
            __IM  uint32_t RESERVED1        : 2;
            __IOM uint32_t CH2CCEN          : 1;
            __IOM uint32_t CH2CCP           : 1;
            __IM  uint32_t RESERVED2        : 2;
            __IM  uint32_t RESERVED3        : 24;
        }CHCTRL1_B;
    };

    /* Channel control register 2 */
    union
    {
        __IOM uint32_t CHCTRL2;

        struct
        {
            __IOM uint32_t CH3CCEN          : 1;
            __IOM uint32_t CH3CCP           : 1;
            __IM  uint32_t RESERVED         : 30;

        }CHCTRL2_B;
    };

    /* Count register 1 */
    union
    {
        __IOM uint32_t CNT1;

        struct
        {
            __IOM uint32_t CNT              : 8;
            __IM  uint32_t RESERVED         : 24;
        }CNT1_B;
    };

    /* Count register 0 */
    union
    {
        __IOM uint32_t CNT0;

        struct
        {
            __IOM uint32_t CNT              : 8;
            __IM  uint32_t RESERVED         : 24;
        }CNT0_B;
    };

