MikroElektronika/core_packages/ARM/gcc_clang/def/geehy/APM32F003F4/mcu.h
    /* divider register */
    union
    {
        __IOM uint32_t PSC;

        struct
        {
            __IOM uint32_t PSC              : 8;
            __IM  uint32_t RESERVED         : 24;
        }DIV_B;
    };


    /* Auto reload register 1 */
    union
    {
        __IOM uint32_t AUTORLD1;

        struct
        {
            __IOM uint32_t AUTORLD          : 8;
            __IM  uint32_t RESERVED         : 24;
        }AUTORLD1_B;
    };

    /* Auto reload register 0 */
    union
    {
        __IOM uint32_t AUTORLD0;

        struct
        {
            __IOM uint32_t AUTORLD          : 8;
            __IM  uint32_t RESERVED         : 24;
        }AUTORLD0_B;
    };

    /* channel 1 compare/capture register 1 */
    union
    {
        __IOM uint32_t CH1CC1;

        struct
        {
            __IOM uint32_t CC               : 8;
            __IM  uint32_t RESERVED         : 24;
        }CH1CC1_B;
    };

    /* channel 1 compare/capture register 0 */
    union
    {
        __IOM uint32_t CH1CC0;

        struct
        {
            __IOM uint32_t CC               : 8;
            __IM  uint32_t RESERVED         : 24;
        }CH1CC0_B;
    };

    /* channel 2 compare/capture register 1 */
    union
    {
        __IOM uint32_t CH2CC1;

        struct
        {
            __IOM uint32_t CC               : 8;
            __IM  uint32_t RESERVED         : 24;
        }CH2CC1_B;
    };

    /* channel 2 compare/capture register 0 */
    union
    {
        __IOM uint32_t CH2CC0;

        struct
        {
            __IOM uint32_t CC               : 8;
            __IM  uint32_t RESERVED         : 24;
        }CH2CC0_B;
    };

    /* channel 3 compare/capture register 1 */
    union
    {
        __IOM uint32_t CH3CC1;

        struct
        {
            __IOM uint32_t CC               : 8;
            __IM  uint32_t RESERVED         : 24;
        }CH3CC1_B;
    };

    /* channel 3 compare/capture register 0 */
    union
    {
        __IOM uint32_t CH3CC0;

        struct
        {
            __IOM uint32_t CC               : 8;
            __IM  uint32_t RESERVED         : 24;
        }CH3CC0_B;
    };
}TMR2_T;

/**
 * @brief   Timer4
 */
typedef struct
{
    /* Control register 1 */
    union
    {
        __IOM uint32_t CTRL1;
        struct
        {
            __IOM uint32_t CNTEN            : 1;
            __IOM uint32_t NGUE             : 1;
            __IOM uint32_t UES              : 1;
            __IOM uint32_t SPMEN            : 1;
            __IM  uint32_t RESERVED1        : 3;
            __IOM uint32_t ARBEN            : 1;
            __IM  uint32_t RESERVED2        : 24;
        }CTRL1_B;
    };

    /* Control register 2 */
    union
    {
        __IOM uint32_t CTRL2;
        struct
        {
            __IM  uint32_t RESERVED1        : 4;
            __IOM uint32_t MMFC             : 3;
            __IM  uint32_t RESERVED2        : 25;
        }CTRL2_B;
    };

    /* Slave mode congrol register */
    union
    {
        __IOM uint32_t SMC;
        struct
        {
            __IOM uint32_t SMFC             : 3;
            __IM  uint32_t RESERVED1        : 1;
            __IOM uint32_t ITC              : 3;
            __IOM uint32_t MSMEN            : 1;
            __IM  uint32_t RESERVED2        : 24;
        }SMC_B;
    };

    /* interrupt control register */
    union
    {
        __IOM uint32_t INTCTRL;
        struct
        {
            __IOM uint32_t UDIE             : 1;
            __IM  uint32_t RESERVED1        : 5;
            __IOM uint32_t TRGIE            : 1;
            __IM  uint32_t RESERVED2        : 25;
        }INTCTRL_B;
    };

    /* status register */
    union
    {
        __IOM uint32_t STS;
        struct
        {
            __IOM uint32_t UDIF             : 1;
            __IM  uint32_t RESERVED1        : 5;
            __IOM uint32_t TRGIF            : 1;
            __IM  uint32_t RESERVED2        : 25;
        }STS1_B;
    };

    /* Software control event generate register */
    union
    {
        __IOM uint32_t SCEG;
        struct
        {
            __IOM uint32_t UEG              : 1;
            __IM  uint32_t RESERVED1        : 5;
            __IOM uint32_t TEG              : 1;
            __IM  uint32_t RESERVED2        : 25;
        }SCEG_B;
    };

    /* Count register */
    union
    {
        __IOM uint32_t CNT;

        struct
        {
            __IOM uint32_t CNT              : 8;
            __IM  uint32_t RESERVED         : 24;
        }CNT_B;
    };

    /* divider register */
    union
    {
        __IOM uint32_t PSC;

        struct
        {
            __IOM uint32_t PSC              : 3;
            __IM  uint32_t RESERVED         : 29;
        }DIV_B;
    };


    /* Auto reload register */
    union
    {
        __IOM uint32_t AUTORLD;

        struct
        {
            __IOM uint32_t AUTORLD          : 8;
            __IM  uint32_t RESERVED         : 24;
        }AUTORLD_B;
    };
}TMR4_T;

/**
 * @brief   SPI
 */
typedef struct
{
    /* Control  register 1 */
    union
    {
        __IOM uint32_t CTRL1;

        struct
        {
            __IOM uint32_t CLKPHA           : 1;
            __IOM uint32_t CLKPOL           : 1;
            __IOM uint32_t MSTMODE          : 1;
            __IOM uint32_t BRC              : 3;
            __IOM uint32_t SPIEN            : 1;
            __IOM uint32_t LSBF             : 1;
            __IM  uint32_t RESERVED         : 24;
        }CTRL1_B;
    };

    /* Control  register 2 */
    union
    {
        __IOM uint32_t CTRL2;

        struct
        {
            __IOM uint32_t ISS              : 1;
            __IOM uint32_t SSC              : 1;
            __IOM uint32_t UMRXO            : 1;
            __IM  uint32_t RESERVED1        : 1;
            __IOM uint32_t CRCNXT           : 1;
            __IOM uint32_t CRCEN            : 1;
            __IOM uint32_t BMTX             : 1;
            __IOM uint32_t BMEN             : 1;
            __IM  uint32_t RESERVED2        : 24;
        }CTRL2_B;
    };

    /* Interrupt control  register */
    union
    {
        __IOM uint32_t INTCTRL;

        struct
        {
            __IM  uint32_t RESERVED1        : 4;
            __IOM uint32_t WUPIE            : 1;
            __IOM uint32_t ERRIE            : 1;
            __IOM uint32_t RXBNEIE          : 1;
            __IOM uint32_t TXBEIE           : 1;
            __IM  uint32_t RESERVED2        : 24;
        }INTCTRL_B;
    };

