MikroElektronika/core_packages/ARM/gcc_clang/def/geehy/APM32F003F4/mcu.h
    /* Status register */
    union
    {
        __IOM uint32_t STS;

        struct
        {
            __IOM uint32_t RXBNEF           : 1;
            __IOM uint32_t TXBEF            : 1;
            __IM  uint32_t RESERVED1        : 1;
            __IOM uint32_t WUPF             : 1;
            __IOM uint32_t CRCEF            : 1;
            __IOM uint32_t MMEF             : 1;
            __IOM uint32_t RXOF             : 1;
            __IOM uint32_t BUSYF            : 1;
            __IM  uint32_t RESERVED2        : 24;
        }STS_B;
    };

    /* Data register */
    union
    {
        __IOM uint32_t DATA;

        struct
        {
            __IOM uint32_t DATA             : 8;
            __IM  uint32_t RESERVED2        : 24;
        }DATA_B;
    };

    /* CRC polynomial register */
    union
    {
        __IOM uint32_t CRCPOLY;

        struct
        {
            __IOM uint32_t CRCPOLY          : 8;
            __IM  uint32_t RESERVED2        : 24;
        }CRCPOLY_B;
    };

    /* Rx CRC register */
    union
    {
        __IOM uint32_t RXCRC;

        struct
        {
            __IOM uint32_t RXCRC            : 8;
            __IM  uint32_t RESERVED2        : 24;
        }RXCRC_B;
    };

    /* Tx CRC register */
    union
    {
        __IOM uint32_t TXCRC;

        struct
        {
            __IOM uint32_t TXCRC            : 8;
            __IM  uint32_t RESERVED2        : 24;
        }TXCRC_B;
    };
}SPI_T;

/**
 * @brief   ADC
 */
typedef struct
{
    /* Data buffer */
    __IOM uint32_t DATABUF[20];

    __IM uint32_t RESERVED[12];

    /* Control  status register 1 */
    union
    {
        __IOM uint32_t CSTS;

        struct
        {
            __IOM uint32_t CHSEL            : 4;
            __IOM uint32_t AWDIE            : 1;
            __IOM uint32_t CCIE             : 1;
            __IOM uint32_t AWDF             : 1;
            __IOM uint32_t CCF              : 1;
            __IM  uint32_t RESERVED2        : 24;
        }CSTS_B;
    };

    /* Control register 1 */
    union
    {
        __IOM uint32_t CTRL1;

        struct
        {
            __IOM uint32_t ADCON            : 1;
            __IOM uint32_t CCM              : 1;
            __IM  uint32_t RESERVED1        : 2;
            __IOM uint32_t DIVSEL           : 3;
            __IM  uint32_t RESERVED2        : 25;
        }CTRL1_B;
    };

    /* Control register 2 */
    union
    {
        __IOM uint32_t CTRL2;

        struct
        {
            __IM  uint32_t RESERVED1        : 1;
            __IOM uint32_t SMEN             : 1;
            __IM  uint32_t RESERVED2        : 1;
            __IOM uint32_t DAM              : 1;
            __IOM uint32_t ETS              : 2;
            __IOM uint32_t ETEN             : 1;
            __IM  uint32_t RESERVED3        : 25;
        }CTRL2_B;
    };

    /* Control register 3 */
    union
    {
        __IOM uint32_t CTRL3;

        struct
        {
            __IM  uint32_t RESERVED1        : 6;
            __IOM uint32_t OVRF             : 1;
            __IOM uint32_t DBEN             : 1;
            __IM  uint32_t RESERVED2        : 24;
        }CTRL3_B;
    };

    /* DATA register 1 */
    union
    {
        __IOM uint32_t DATA1;

        struct
        {
            __IOM uint32_t DATA             : 8;
            __IM  uint32_t RESERVED         : 24;
        }DATA1_B;
    };

    /* DATA register 0 */
    union
    {
        __IOM uint32_t DATA0;

        struct
        {
            __IOM uint32_t DATA             : 8;
            __IM  uint32_t RESERVED         : 24;
        }DATA0_B;
    };

    /* Schmitt trigger disable register 1 */
    union
    {
        __IOM uint32_t STD1;

        struct
        {
            __IOM uint32_t STD              : 8;
            __IM  uint32_t RESERVED         : 24;
        }STD1_B;
    };

    /* Schmitt trigger disable register 0 */
    union
    {
        __IOM uint32_t STD0;

        struct
        {
            __IOM uint32_t STD              : 8;
            __IM  uint32_t RESERVED         : 24;
        }STD0_B;
    };

    /* Analog Watch Dog high threshold register 1 */
    union
    {
        __IOM uint32_t AWDHT1;

        struct
        {
            __IOM uint32_t THRESHOLD        : 8;
            __IM  uint32_t RESERVED         : 24;
        }AWDHT1_B;
    };

    /* Analog Watch Dog high threshold register 0 */
    union
    {
        __IOM uint32_t AWDHT0;

        struct
        {
            __IOM uint32_t THRESHOLD        : 4;
            __IM  uint32_t RESERVED         : 28;
        }AWDHT0_B;
    };

    /* Analog Watch Dog low threshold register 1 */
    union
    {
        __IOM uint32_t AWDLT1;

        struct
        {
            __IOM uint32_t THRESHOLD        : 8;
            __IM  uint32_t RESERVED         : 24;
        }AWDLT1_B;
    };

    /* Analog Watch Dog low threshold register 0 */
    union
    {
        __IOM uint32_t AWDLT0;

        struct
        {
            __IOM uint32_t THRESHOLD        : 4;
            __IM  uint32_t RESERVED         : 28;
        }AWDLT0_B;
    };

    /* Analog Watch Dog status register 1 */
    union
    {
        __IOM uint32_t AWDS1;

        struct
        {
            __IOM uint32_t AWDS             : 8;
            __IM  uint32_t RESERVED         : 24;
        }AWDS1_B;
    };

    /* Analog Watch Dog status register 0 */
    union
    {
        __IOM uint32_t AWDS0;

        struct
        {
            __IOM uint32_t AWDS             : 8;
            __IM  uint32_t RESERVED         : 24;
        }AWDS0_B;
    };

    /* Analog Watch Dog enable register 1 */
    union
    {
        __IOM uint32_t AWDEN1;

        struct
        {
            __IOM uint32_t AWDEN             : 8;
            __IM  uint32_t RESERVED         : 24;
        }AWDEN1_B;
    };

    /* Analog Watch Dog enable register 0 */
    union
    {
        __IOM uint32_t AWDEN0;

        struct
        {
            __IOM uint32_t AWDEN             : 8;
            __IM  uint32_t RESERVED         : 24;
        }AWDEN0_B;
    };

